'use strict';

(function () {
  window.data = {
    photoComments: [
      'Всё отлично!',
      'В целом всё неплохо. Но не всё.',
      'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
      'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
      'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
      'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
    ],
    photoDescriptions: [
      'Тестим новую камеру!',
      'Затусили с друзьями на море',
      'Как же круто тут кормят',
      'Отдыхаем...',
      'Цените каждое мгновенье. Цените тех, кто рядом с вами и отгоняйте все сомненья. Не обижайте всех словами......',
      'Вот это тачка!'
    ],
    errorText: {
      number: 'Количество хэштегов не должно превышать 5',
      identical: 'Хэштеги не должны повторяться',
      oneСharacter: 'Xештег не может состоять только из одного символа',
      missingHashSymbol: 'Хештег должен начинаться с символа #',
      length: 'Длина хештега не должна превышать 20 символов'
    }
  };
})();
